In [1]:
import numpy as np
import pandas as pd

In [2]:
#indices com multi nível
#leitura de json ou arquivos que tenham níveis e subníveis

In [3]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]

In [4]:
hier_index = list(zip(outside,inside))

In [5]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [6]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [7]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [8]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index,columns=['col_A','col_B'])

In [9]:
df

         col_A     col_B
G1 1 -0.650708 -2.146811
   2 -1.820008  0.900648
   3  1.161423  0.868283
G2 1 -0.301725 -0.138097
   2  0.503987  0.261874
   3 -1.529543  1.693952

In [10]:
df.loc['G1']

      col_A     col_B
1 -0.650708 -2.146811
2 -1.820008  0.900648
3  1.161423  0.868283

In [11]:
df.loc['G1'].loc[1]

col_A   -0.650708
col_B   -2.146811
Name: 1, dtype: float64

In [12]:
df.index.names = ['Grupo','id']

In [13]:
df

             col_A     col_B
Grupo id
G1    1  -0.650708 -2.146811
      2  -1.820008  0.900648
      3   1.161423  0.868283
G2    1  -0.301725 -0.138097
      2   0.503987  0.261874
      3  -1.529543  1.693952

In [ ]:
#

In [14]:
df.xs('G1')

       col_A     col_B
id
1  -0.650708 -2.146811
2  -1.820008  0.900648
3   1.161423  0.868283

In [15]:
df.xs(1,level='id')

          col_A     col_B
Grupo
G1    -0.650708 -2.146811
G2    -0.301725 -0.138097

In [16]:
#dados ausentes

In [17]:
#tratar o NAN

In [18]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [19]:
df = pd.DataFrame(d)

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
#exclui as linhas que contenho NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [22]:
#substinui o NaN por algo conveniente
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [23]:
df.fillna('Ausente')

         A        B  C
0        1        5  1
1        2  Ausente  2
2  Ausente  Ausente  3

In [24]:
df.fillna('N/A')

     A    B  C
0    1    5  1
1    2  N/A  2
2  N/A  N/A  3

In [25]:
#preencher nulos com a média da coluna
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [26]:
#preencher os nulos com o valor anterior
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [ ]:
#groupby

In [27]:
valores = {
    'especies' : ['versicolor','setosa','virginica','versicolor','setosa','virginica','versicolor','setosa','virginica']
    ,'petala' : [1,2,3,2,3,1,2,3,4]
    ,'sepala' : [4,5,6,5,7,5,3,4,5]
}

In [28]:
df = pd.DataFrame(valores)

In [29]:
df

     especies  petala  sepala
0  versicolor       1       4
1      setosa       2       5
2   virginica       3       6
3  versicolor       2       5
4      setosa       3       7
5   virginica       1       5
6  versicolor       2       3
7      setosa       3       4
8   virginica       4       5

In [30]:
agrupado = df.groupby('especies')

In [31]:
agrupado

In [32]:
agrupado.sum()

            petala  sepala
especies
setosa           8      16
versicolor       5      12
virginica        8      16

In [33]:
agrupado.mean()

              petala    sepala
especies
setosa      2.666667  5.333333
versicolor  1.666667  4.000000
virginica   2.666667  5.333333

In [34]:
df_iris = pd.read_csv('iris.csv',sep=';')

In [36]:
df_iris

,Id,Comprimento_Sepala,Largura_Sepala,Comprimento_Petala,Largura_Petala,Especie
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [37]:
df_iris.groupby('Especie').mean()

,Id,Comprimento_Sepala,Largura_Sepala,Comprimento_Petala,Largura_Petala
Especie,,,,,
setosa,25.5,5.006,3.418,1.464,0.244
versicolor,75.5,5.936,2.770,4.260,1.326
virginica,125.5,6.588,2.974,5.552,2.026

In [38]:
df_iris.groupby('Especie').describe()

              Id                                                        \
           count   mean       std    min     25%    50%     75%    max
Especie
setosa      50.0   25.5  14.57738    1.0   13.25   25.5   37.75   50.0
versicolor  50.0   75.5  14.57738   51.0   63.25   75.5   87.75  100.0
virginica   50.0  125.5  14.57738  101.0  113.25  125.5  137.75  150.0

           Comprimento_Sepala         ... Comprimento_Petala       \
                        count   mean  ...                75%  max
Especie                               ...
setosa                   50.0  5.006  ...              1.575  1.9
versicolor               50.0  5.936  ...              4.600  5.1
virginica                50.0  6.588  ...              5.875  6.9

           Largura_Petala
                    count   mean       std  min  25%  50%  75%  max
Especie
setosa               50.0  0.244  0.107210  0.1  0.2  0.2  0.3  0.6
versicolor           50.0  1.326  0.197753  1.0  1.2  1.3  1.5  1.8
virginica            50.0  2.026  0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]